In [1]:
import pandas as pd

india_weather = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'banglore'],
    'temperature': [32, 40, 35],
    'humidity': [80, 60, 77]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           40        60
2  banglore           35        77

In [2]:
us_weather = pd.DataFrame({
    'city': ['new york', 'philadelphia', 'washington'],
    'temperature': [35, 45, 39],
    'humidity': [55, 66, 70]
})
us_weather

           city  temperature  humidity
0      new york           35        55
1  philadelphia           45        66
2    washington           39        70

In [7]:
df = pd.concat([india_weather, us_weather], keys = ['india', 'us'])
df

                 city  temperature  humidity
india 0        mumbai           32        80
      1         delhi           40        60
      2      banglore           35        77
us    0      new york           35        55
      1  philadelphia           45        66
      2    washington           39        70

In [9]:
df.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           40        60
2  banglore           35        77

In [17]:
temperature_df = pd.DataFrame({
    'city': ['mumbai', 'delhi', 'banglore'],
    'temperature': [32, 40, 35]   
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           40
2  banglore           35

In [18]:
windspeed_df = pd.DataFrame({
    'city': ['delhi', 'mumbai'],
    'windspeed': [8, 6]
}, index=[1, 0])
windspeed_df

     city  windspeed
1   delhi          8
0  mumbai          6

In [19]:
df = pd.concat([temperature_df, windspeed_df], axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai        6.0
1     delhi           40   delhi        8.0
2  banglore           35     NaN        NaN